import { Link } from "react-router-dom";
import photoLylia from "../images/lylia_photo.png";
import photoEgor from "../images/egor_photo.png";

export const GenderSelection = () => {
  return (
    <div className="gender_selection_wrapper">
      <p className="gender_text">Наибольшая база анкет для знакомств</p>
      <Link className="transition_link" to="/purposeofdating">
        <label className="button_gender button_man">
          Я мужчина
          <input
            className="button_gender_selection"
            type="radio"
            name="gender-selection"
            value="Я мужчина"
          />
          <svg
            width="12"
            height="22"
            viewBox="0 0 12 22"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              d="M6.00043 4.16505C7.20788 4.16505 8.18694 3.23254 8.18694 2.08257C8.1869 0.932198 7.20788 0 6.00043 0C4.7926 0 3.81311 0.932198 3.81311 2.08253C3.81306 3.23254 4.79255 4.16505 6.00043 4.16505Z"
              fill="#242530"
            />
            <path
              d="M11.9082 11.4266L9.4357 6.03756C9.18654 5.49417 8.66204 5.1336 8.06052 5.03653C7.96952 5.01373 4.03074 5.01336 3.93664 5.03731C3.33595 5.13465 2.81256 5.49523 2.56384 6.03792L0.0915822 11.4262C-0.0566081 11.7498 -0.0234188 12.1224 0.179974 12.4177C0.383367 12.7131 0.729628 12.8909 1.10105 12.8909C1.53913 12.8909 1.93523 12.6444 2.11051 12.2628L3.04223 10.2323V20.8582C3.04223 21.4889 3.58008 22 4.24367 22C4.90764 22 5.44545 21.4889 5.44545 20.8582V13.6906H6.55477V20.8582C6.55477 21.4889 7.09262 22 7.75616 22C8.41931 22 8.95721 21.4889 8.95721 20.8586V10.2315L9.88936 12.2632C10.0646 12.6448 10.4607 12.8913 10.8988 12.8913C11.2702 12.8913 11.6165 12.7135 11.8199 12.4182C12.0233 12.1231 12.0568 11.7502 11.9082 11.4266Z"
              fill="#242530"
            />
          </svg>
        </label>
      </Link>
      <Link className="transition_link" to="/purposeofdating">
        <label className="button_gender button_woman">
          Я женщина
          <input
            className="button_gender_selection"
            type="radio"
            name="gender-selection"
            value="Я женщина"
          />
          <svg
            width="13"
            height="22"
            viewBox="0 0 13 22"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              d="M6.50042 4.21362C7.64842 4.21362 8.57963 3.27034 8.57963 2.10679C8.57967 0.943234 7.64842 0 6.50042 0C5.35166 0 4.42046 0.943234 4.42046 2.10679C4.4205 3.27034 5.35166 4.21362 6.50042 4.21362Z"
              fill="#242530"
            />
            <path
              d="M12.3479 10.7877L9.02891 5.60138C8.8013 5.24558 8.42076 5.02039 7.99993 5.01323C7.98877 5.01301 5.01122 5.01314 5.00002 5.01323C4.58439 5.01602 4.19874 5.24554 3.97104 5.60138L0.65211 10.7877C0.463689 11.0821 0.449322 11.4574 0.614568 11.7657C0.780259 12.0739 1.09896 12.2659 1.44529 12.2659C1.76577 12.2659 2.06411 12.1016 2.23856 11.8292L3.41356 9.99347L2.59868 14.3259C2.56914 14.4827 2.6102 14.6444 2.71068 14.7672C2.81089 14.8903 2.96008 14.9613 3.11763 14.9613H3.72738V20.8588C3.72738 21.4892 4.2317 22 4.85399 22C5.476 22 5.98028 21.4892 5.98028 20.8592V14.9612H7.02007V20.8588C7.02007 21.4888 7.52439 21.9996 8.14632 21.9996C8.76834 21.9996 9.27262 21.4888 9.27262 20.8588V14.9612H9.88236C10.04 14.9612 10.1892 14.8903 10.2893 14.7672C10.3899 14.6444 10.4308 14.4827 10.4014 14.3259L9.58638 9.99306L10.7613 11.8292C10.9358 12.1016 11.2342 12.2658 11.5546 12.2658C11.901 12.2658 12.2196 12.0739 12.3854 11.7656C12.5507 11.4574 12.5363 11.0821 12.3479 10.7877Z"
              fill="#242530"
            />
          </svg>
        </label>
      </Link>
      <div className="block_comments">
        <section className="comment">
          <img
            className="photo_commenters_lylia"
            src={photoLylia}
            alt="Фото коментатора Лили"
          />
          <img
            className="photo_commenters_ehor"
            src={photoEgor}
            alt="Фото коментатора Егора"
          />
          <p className="commenters_name">Аня и Дима</p>
          <span className="data_comment">23 недели назад</span>
          <p className="comment_text">
            Безопасность и анонимность пользователей — наш главный приоритет. Мы
            используем новейшие технологии, чтобы защитить вашу личную
            информацию и данные, указанные при регистрации. Мы используем
            новейшие технологии, чтобы защитить вашу защитить и личную...
            <span className="link_read_more">Читать полностю</span>
          </p>
        </section>
      </div>
    </div>
  );
};
